docs/02-boolean-logic.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Engineering Computer Architecture</title>
<link rel="stylesheet" href="file:///Users/ashroyer-admin/repo/reveal.js-master/dist/reveal.css"/>

<link rel="stylesheet" href="file:///Users/ashroyer-admin/repo/reveal.js-master/dist/theme/solarized.css" id="theme"/>


</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Engineering Computer Architecture</h1><em>How computer hardware and software is made.</em><br><br><br>
</section>
<section>
<section id="slide-org9cf38d1">
<h2 id="org9cf38d1">02</h2>
<p>
Boolean Logic
</p>
</section>
</section>
<section>
<section id="slide-org26f9d4f">
<h2 id="org26f9d4f">Boolean Values</h2>
<p>
must be one of two options
</p>

<!-- This HTML table template is generated by emacs 28.0.90 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;true&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;false&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;on&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;off&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;yes&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;no&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;1&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
</table>

</section>
</section>
<section>
<section id="slide-orgf2a2277">
<h2 id="orgf2a2277">Boolean Operations</h2>
</section>
<section id="slide-orgf2a2277-split">
<div style="display:flex"><div style="width:30vw">
<p>
x And y
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">x</th>
<th scope="col" class="org-right">y</th>
<th scope="col" class="org-right">x∧y</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>
</div><div style="width:30vw">
<p>
x Or y
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">x</th>
<th scope="col" class="org-right">y</th>
<th scope="col" class="org-right">x∨y</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>
</div><div style="width:30vw">
<p>
Not x
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">x</th>
<th scope="col" class="org-right">¬x</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">0</td>
</tr>
</tbody>
</table>
</div></div>

</section>
<section id="slide-orgf2a2277-split">
<p>
Alternative notation:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">x And y</th>
<th scope="col" class="org-left">x Or y</th>
<th scope="col" class="org-left">Not x</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>xy</code></td>
<td class="org-left"><code>x+y</code></td>
<td class="org-left"><code>~x</code></td>
</tr>
</tbody>
</table>

<p>
<code>xy</code> is sometimes written as <code>x*y</code>
</p>
</section>
</section>
<section>
<section id="slide-org0b7260c">
<h2 id="org0b7260c">Boolean Expressions</h2>
<p>
Not (0 Or (1 And 1)) =
</p>

<p>
Not (0 Or 1) =
</p>

<p>
Not (1) =
</p>

<p>
0
</p>
</section>
</section>
<section>
<section id="slide-org9e885ce">
<h2 id="org9e885ce">Boolean Functions</h2>
<div class="outline-text-2" id="text-org9e885ce">
</div>
</section>
<section id="slide-org4bae46d">
<h3 id="org4bae46d">formula</h3>
<p>
f(x,y,z) = (x And y) Or (Not(x) And z)
</p>

</section>
<section id="slide-orga1c8a26">
<h3 id="orga1c8a26">truth table (incomplete)</h3>
<p>
f(x,y,z) = (x And y) Or (Not(x) And z)
</p>
<div style="font-size:0.5em">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">x</th>
<th scope="col" class="org-right">y</th>
<th scope="col" class="org-right">z</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">f</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>
</div>

</section>
<section id="slide-orga1c8a26-split">
<p>
(demonstration: fill in the blanks)
</p>

</section>
<section id="slide-orga1c8a26-split">
<p>
f(x,y,z) = (x And y) Or (Not(x) And z)
</p>

<div style="font-size:0.5em">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">x</th>
<th scope="col" class="org-right">y</th>
<th scope="col" class="org-right">z</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">f</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>
</div>
</section>
</section>
<section>
<section id="slide-org738505f">
<h2 id="org738505f">Boolean Identities</h2>
<div style="font-size:0.5em">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">example</th>
<th scope="col" class="org-left">identity</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">(x And y) = (y And x)</td>
<td class="org-left">commutative</td>
</tr>

<tr>
<td class="org-left">(x Or y) = (y Or x)</td>
<td class="org-left">commutative</td>
</tr>

<tr>
<td class="org-left">(x And (y And z)) = ((x And y) And z)</td>
<td class="org-left">associative</td>
</tr>

<tr>
<td class="org-left">(x Or (y Or z)) = ((x Or y) Or z)</td>
<td class="org-left">associative</td>
</tr>

<tr>
<td class="org-left">(x And (y Or z)) = (x And y) Or (x And z)</td>
<td class="org-left">distributive</td>
</tr>

<tr>
<td class="org-left">(x Or (y And z)) = (x Or y) And (x Or z)</td>
<td class="org-left">distributive</td>
</tr>

<tr>
<td class="org-left">Not(x And y) = Not(x) Or Not(y)</td>
<td class="org-left">De Morgan&rsquo;s</td>
</tr>

<tr>
<td class="org-left">Not(x Or y) = Not(x) And Not(y)</td>
<td class="org-left">De Morgan&rsquo;s</td>
</tr>
</tbody>
</table>
</div>
</section>
</section>
<section>
<section id="slide-orgcebcd38">
<h2 id="orgcebcd38">Boolean Algebra</h2>
<div style="font-size:0.5em">
<div style="display:flex"><div style="width:50vw">
<p>
Not(Not(x) And Not(x Or y)) =
</p>

<p>
Not(Not(x) And (Not(x) And Not(y))) =
</p>

<p>
Not((Not(x) And Not(x)) And Not(y)) =
</p>

<p>
Not(Not(x) And Not(y)) =
</p>

<p>
Not(Not(x)) Or Not(Not(y)) =
</p>

<p>
x Or y
</p>
</div><div style="width:50vw">
<p>
(De Morgan)
</p>

<p>
(associative)
</p>

<p>
(idempotence)
</p>

<p>
(De Morgan)
</p>

<p>
(double negation)
</p>
</div></div>
</div>
</section>
</section>
</div>
</div>
<script src="file:///Users/ashroyer-admin/repo/reveal.js-master/dist/reveal.js"></script>
<script src="file:///Users/ashroyer-admin/repo/reveal.js-master/plugin/markdown/markdown.js"></script>
<script src="file:///Users/ashroyer-admin/repo/reveal.js-master/plugin/zoom/zoom.js"></script>
<script src="file:///Users/ashroyer-admin/repo/reveal.js-master/plugin/notes/notes.js"></script>


<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({
plugins: [RevealMarkdown, RevealZoom, RevealNotes],
slideNumber:"c/t", transition:"none", transitionSpeed:"fast", controlsTutorial:false, minScale:1.0, maxScale:1.5
});

</script>
</body>
</html>
